package com.example.test0.bean;

import java.util.List;

public class HistoryTodayBean {


    /**
     * code : 0000
     * data : [{"content":"1923年1月1日　广东海丰县农会成立。这是我国第一个县农会，内设教育、卫生、财政、农业、仲裁等部。彭湃任会长，会员约10万人，占海丰全县人口的四分之一。在海丰农民运动的影响下，陆丰、惠阳等县的农民运动相继发展起来。","datestr":"1月1日","index":"1","title":"1923年1月1日 广东海丰县农会成立"},{"content":"1924年1月1日 中共中央和社会主义青年团中央在上海举行联席会议，讨论国民党改组问题。鲍罗廷在会上作报告；陈独秀报告自党的三大以来国共合作进展情况。会议通过以下决议：(1)中共中央和青年团中央联席会议在听取鲍罗廷同志和陈独秀同志关于国民党改组工作的报告后，认为工作进行得正确；(2)共产党员在加入国民党以后应该反对老国民党人对国民革命运动的错误理解；(3)共产党员不应该在各种委员会中谋求职位；(4)关于宣言问题，全体共产党员代表应当捍卫它的所有条款。在组织问题上，不应用章程来束缚代表。在各省，必须选举左派作为出席代表大会的代表。","datestr":"1月1日","index":"2","title":"1924年1月1日 中共中央和社会主义青年团中央举行联席会议"},{"content":"1948年1月1日　由国民党各民主派别联合组成的中国国民党革命委员会在香港成立，并发表宣言，明确提出要\u201c推翻蒋介石卖国独裁政权\u201d。1月5日至19日，中国民主同盟中央常委沈钧儒、章伯钧在香港召开民盟一届三中全会，调整和充实民盟领导机构，恢复活动，并发表宣言，主张采取革命方法，反对国民党反动政府和美国的对华政策。中共中央发言人对民革的成立和民盟恢复活动表示欢迎，指出：这\u201c表示反对美国帝国主义与蒋介石反动统治集团的民族民主运动的统一战线，是何等广阔\u201d。","datestr":"1月1日","index":"3","title":"1948年1月1日 国民党各民主派别联合组成的中国国民党革命委员会在香港成立"},{"content":"1952年1月1日　毛泽东在元旦团拜会上号召：\u201c我国全体人民和一切工作人员一致起来，大张旗鼓地，雷厉风行地，开展一个大规模的反对贪污、反对浪费、反对官僚主义的斗争，将这些旧社会遗留下来的污毒洗干净！\u201d4日，中共中央发出《关于立即限期发动群众开展\u201c三反\u201d斗争的指示》，要求各单位立即按限期发动群众开展斗争。","datestr":"1月1日","index":"4","title":"1952年1月1日 毛泽东号召开展大规模反对贪污、反对浪费、反对官僚主义的斗争"},{"content":"1953年1月1日　我国开始执行发展国民经济的第一个五年计划。","datestr":"1月1日","index":"5","title":"1953年1月1日 我国开始执行发展国民经济的第一个五年计划"},{"content":"1979年1月1日　全国人大常委会发表《告台湾同胞书》，指出：实现中国的统一，是人心所向，大势所趋。我国领导人已经表示决心，一定要考虑现实情况，完成祖国统一大业。我们建议双方首先结束军事对峙状态；尽快实现通航通邮；发展贸易，进行经济交流。当天下午，全国政协就此举行座谈会。邓小平在会上发表《解决台湾问题，完成祖国统一大业提上具体日程》的讲话。同日，国防部部长徐向前发表声明，宣布从即日起停止对大金门、小金门、大担、二担等岛屿的炮击。至此，从1958年开始的对上述地区的炮击结束。","datestr":"1月1日","index":"6","title":"1979年1月1日 全国人大常委会发表《告台湾同胞书》"},{"content":"1979年1月1日  中美两国正式建立外交关系。","datestr":"1月1日","index":"7","title":"1979年1月1日 中美建交"},{"content":"1982年1月1日　中共中央批转《全国农村工作会议纪要》（1982年中央1号文件）。《纪要》指出：目前，全国农村已有百分之九十以上的生产队建立了不同形式的农业生产责任制，包括小段包工定额计酬，专业承包联产计酬，联产到劳，包产到户、到组，包干到户、到组等，都是社会主义集体经济的生产责任制，反映了亿万农民要求按照中国农村的实际状况来发展社会主义农业的强烈愿望。不论采取什么形式，只要群众不要求改变，就不要变动。各级党的领导应向干部和群众说明，我国农业必须坚持社会主义集体化的道路，土地等基本生产资料公有制是长期不变的，集体经济要建立生产责任制也是长期不变的。","datestr":"1月1日","index":"8","title":"1982年1月1日 中共中央批转《全国农村工作会议纪要》"},{"content":"1984年1月1日　中共中央发出《关于1984年农村工作的通知》（简称1984年中央１号文件），强调稳定和完善生产责任制，提高生产水平，疏通流通渠道，发展商品生产，延长土地承包期一般应在15年以上。16日至26日，农牧渔业部召开全国农业工作会议，讨论贯彻落实《通知》精神，表示要用大胆探索、勇于改革的精神，巩固和完善联产承包责任制，迅速把主要精力转到抓好商品生产上来，使广大农民尽快富裕起来。","datestr":"1月1日","index":"9","title":"1984年1月1日 中共中央发出《关于1984年农村工作的通知》"},{"content":"1985年1月1日 中共中央、国务院发布《关于进一步活跃农村经济的十项政策》（简称1985年中央1号文件）。文件指出：打破集体经济中的\u201c大锅饭\u201d以后，农村的工作重点是，进一步改革农业管理体制，改革农产品统购派购制度，在国家计划指导下，扩大市场调节，使农业生产适应市场需要，促进农村产业结构的合理化，进一步把农村经济搞活。以这个文件为标志，我国的农村开始了以改革农产品统购派购制度、调整产业结构为主要内容的第二步改革。","datestr":"1月1日","index":"10","title":"1985年1月1日 中共中央、国务院发布《关于进一步活跃农村经济的十项政策》"},{"content":"1986年1月1日　中共中央、国务院发出《关于1986年农村工作的部署》（简称1986年中央1号文件）。文件指出：我国农村已开始走上有计划发展商品经济的轨道。农业和农村工业必须协调发展，把\u201c无工不富\u201d和\u201c无农不稳\u201d有机地结合起来。1986年农村工作总的要求是：落实政策，深入改革，改善农业生产条件，组织产前产后服务，推动农村经济持续稳定协调发展。","datestr":"1月1日","index":"11","title":"1986年1月1日 中共中央、国务院发出《关于1986年农村工作的部署》"},{"content":"从2006年1月1日起  我国正式取消农业税。","datestr":"1月1日","index":"12","title":"从2006年1月1日起 取消农业税"}]
     * message : 查询成功
     * status : true
     */

    private String code;
    private String message;
    private boolean status;
    private List<DataBean> data;

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public boolean isStatus() {
        return status;
    }

    public void setStatus(boolean status) {
        this.status = status;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * content : 1923年1月1日　广东海丰县农会成立。这是我国第一个县农会，内设教育、卫生、财政、农业、仲裁等部。彭湃任会长，会员约10万人，占海丰全县人口的四分之一。在海丰农民运动的影响下，陆丰、惠阳等县的农民运动相继发展起来。
         * datestr : 1月1日
         * index : 1
         * title : 1923年1月1日 广东海丰县农会成立
         */

        private String content;
        private String datestr;
        private String index;
        private String title;

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public String getDatestr() {
            return datestr;
        }

        public void setDatestr(String datestr) {
            this.datestr = datestr;
        }

        public String getIndex() {
            return index;
        }

        public void setIndex(String index) {
            this.index = index;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }
    }
}
